Revit 2027 API
Form.Rehost(SketchPlane, XYZ) Method
Rehost Form to sketch plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Rehost(
	SketchPlane sketchPlane,
	XYZ location
)
Public Sub Rehost (
	sketchPlane As SketchPlane,
	location As XYZ
)
public:
void Rehost(
	SketchPlane^ sketchPlane,
	XYZ^ location
)
member Rehost :
        sketchPlane : SketchPlane *
        location : XYZ -> unit
Parameters
sketchPlane SketchPlane
The sketch plane on which to rehost the form.
location XYZ
The location to which to Rehost the form.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the sketchPlane or location is null.
InvalidOperationException | Thrown when rehosting Form failed.
See Also
Reference
Form Class
Rehost Overload
Autodesk.Revit.DB Namespace